@ECHO OFF
setlocal
chcp  65001

REM ========================================================================
REM  "全てのソリューションをリビルドする"
REM

pushd "%~dp0"

REM --------------------------------------------------------------------
REM  "TVTest  の全てのソリューションをリビルドする"

pushd TVTest

REM  "TVTest  の全ソリューションのリビルド完了"
echo  TVTest  のビルド完了
popd
REM   PAUSE

REM --------------------------------------------------------------------
REM  "EDCB  の全てのソリューションをリビルドする"

pushd EDCB

REM  "EDCB  の全ソリューションのリビルド完了"
echo  EDCB  のビルド完了
popd
REM   PAUSE

REM --------------------------------------------------------------------

REM  "全てのソリューションのリビルド完了"
echo  全ソリューションのリビルド完了
popd
PAUSE
